backend/app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @uploads = Upload.all

INSERT INTO "uploads" ("attachment", "created_at", "updated_at") VALUES (?, ?, ?)  [["attachment", "186.png"], ["created_at", Thu, 28 Nov 2013 03:44:22 UTC +00:00], ["updated_at", Thu, 28 Nov 2013 03:44:22 UTC +00:00]]
---
  def create
    @upload = Upload.new(upload_params)

    respond_to do |format|
      if @upload.save

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_upload
      @upload = Upload.find(params[:id])